```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.external.git: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.bootstrap.module.aws_api_gateway.aws_api_gateway_account.account will be created
  + resource "aws_api_gateway_account" "account" {
      + cloudwatch_role_arn = (known after apply)
      + id                  = (known after apply)
      + throttle_settings   = (known after apply)
    }

  # module.bootstrap.module.aws_api_gateway.aws_iam_role.api_gateway_cloudwatch will be created
  + resource "aws_iam_role" "api_gateway_cloudwatch" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "api-gateway-cloudwatch"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.bootstrap.module.aws_api_gateway.aws_iam_role_policy.api_gateway_cloudwatch will be created
  + resource "aws_iam_role_policy" "api_gateway_cloudwatch" {
      + id     = (known after apply)
      + name   = "default"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                          + "logs:PutLogEvents",
                          + "logs:GetLogEvents",
                          + "logs:FilterLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.bootstrap.module.aws_logging.data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.bootstrap.module.aws_logging.data.aws_iam_policy_document.bucket_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "bucket_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "bucket-owner-full-control",
                ]
              + variable = "s3:x-amz-acl"
            }

          + principals {
              + identifiers = [
                  + "cloudtrail.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetBucketAcl",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "cloudtrail.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.bootstrap.module.aws_logging.data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      + dns_suffix = (known after apply)
      + id         = (known after apply)
      + partition  = (known after apply)
    }

  # module.bootstrap.module.aws_logging.data.aws_region.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_region" "current"  {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.bootstrap.module.aws_logging.aws_cloudtrail.cloudtrail will be created
  + resource "aws_cloudtrail" "cloudtrail" {
      + arn                           = (known after apply)
      + enable_log_file_validation    = true
      + enable_logging                = true
      + home_region                   = (known after apply)
      + id                            = (known after apply)
      + include_global_service_events = true
      + is_multi_region_trail         = true
      + is_organization_trail         = false
      + kms_key_id                    = (known after apply)
      + name                          = "cloudtrail"
      + s3_bucket_name                = (known after apply)

      + event_selector {
          + include_management_events = true
          + read_write_type           = "All"

          + data_resource {
              + type   = "AWS::S3::Object"
              + values = (known after apply)
            }
        }
      + event_selector {
          + include_management_events = true
          + read_write_type           = "All"

          + data_resource {
              + type   = "AWS::Lambda::Function"
              + values = (known after apply)
            }
        }
    }

  # module.bootstrap.module.aws_logging.aws_kms_key.cloudtrail will be created
  + resource "aws_kms_key" "cloudtrail" {
      + arn                      = (known after apply)
      + customer_master_key_spec = "SYMMETRIC_DEFAULT"
      + description              = "cloudtrail"
      + enable_key_rotation      = false
      + id                       = (known after apply)
      + is_enabled               = true
      + key_id                   = (known after apply)
      + key_usage                = "ENCRYPT_DECRYPT"
      + policy                   = (known after apply)
    }

  # module.bootstrap.module.aws_logging.aws_s3_bucket.logs will be created
  + resource "aws_s3_bucket" "logs" {
      + acceleration_status         = (known after apply)
      + acl                         = "log-delivery-write"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + noncurrent_version_transition {
              + days          = 180
              + storage_class = "DEEP_ARCHIVE"
            }
          + noncurrent_version_transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
          + noncurrent_version_transition {
              + days          = 60
              + storage_class = "GLACIER"
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.bootstrap.module.aws_logging.aws_s3_bucket_policy.bucket_policy will be created
  + resource "aws_s3_bucket_policy" "bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.bootstrap.module.aws_logging.aws_s3_bucket_public_access_block.logs will be created
  + resource "aws_s3_bucket_public_access_block" "logs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.bootstrap.module.aws_organization.aws_organizations_account.account will be created
  + resource "aws_organizations_account" "account" {
      + arn              = (known after apply)
      + email            = "scaffoldly@cnuss.com"
      + id               = (known after apply)
      + joined_method    = (known after apply)
      + joined_timestamp = (known after apply)
      + name             = (known after apply)
      + parent_id        = (known after apply)
      + role_name        = "BootstrapAccessRole"
      + status           = (known after apply)
    }

  # module.bootstrap.module.aws_organization.random_string.random will be created
  + resource "random_string" "random" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.bootstrap.module.aws_organization.time_sleep.wait_120_seconds will be created
  + resource "time_sleep" "wait_120_seconds" {
      + create_duration = "120s"
      + id              = (known after apply)
    }

  # module.bootstrap.module.dns.aws_route53_delegation_set.main will be created
  + resource "aws_route53_delegation_set" "main" {
      + id           = (known after apply)
      + name_servers = (known after apply)
    }

  # module.bootstrap.module.aws_api_gateway.module.domain["live"].aws_api_gateway_domain_name.domain will be created
  + resource "aws_api_gateway_domain_name" "domain" {
      + arn                     = (known after apply)
      + certificate_arn         = (known after apply)
      + certificate_upload_date = (known after apply)
      + cloudfront_domain_name  = (known after apply)
      + cloudfront_zone_id      = (known after apply)
      + domain_name             = (known after apply)
      + id                      = (known after apply)
      + regional_domain_name    = (known after apply)
      + regional_zone_id        = (known after apply)
      + security_policy         = "TLS_1_2"

      + endpoint_configuration {
          + types = (known after apply)
        }
    }

  # module.bootstrap.module.aws_api_gateway.module.domain["live"].aws_route53_record.api_record will be created
  + resource "aws_route53_record" "api_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.bootstrap.module.aws_api_gateway.module.domain["nonlive"].aws_api_gateway_domain_name.domain will be created
  + resource "aws_api_gateway_domain_name" "domain" {
      + arn                     = (known after apply)
      + certificate_arn         = (known after apply)
      + certificate_upload_date = (known after apply)
      + cloudfront_domain_name  = (known after apply)
      + cloudfront_zone_id      = (known after apply)
      + domain_name             = (known after apply)
      + id                      = (known after apply)
      + regional_domain_name    = (known after apply)
      + regional_zone_id        = (known after apply)
      + security_policy         = "TLS_1_2"

      + endpoint_configuration {
          + types = (known after apply)
        }
    }

  # module.bootstrap.module.aws_api_gateway.module.domain["nonlive"].aws_route53_record.api_record will be created
  + resource "aws_route53_record" "api_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.bootstrap.module.dns.module.dns["live"].aws_acm_certificate.apex will be created
  + resource "aws_acm_certificate" "apex" {
      + arn                       = (known after apply)
      + domain_name               = "scaffold.ly"
      + domain_validation_options = [
          + {
              + domain_name           = "scaffold.ly"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.bootstrap.module.dns.module.dns["live"].aws_acm_certificate.subdomain_wildcard will be created
  + resource "aws_acm_certificate" "subdomain_wildcard" {
      + arn                       = (known after apply)
      + domain_name               = "*.scaffold.ly"
      + domain_validation_options = [
          + {
              + domain_name           = "*.scaffold.ly"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.bootstrap.module.dns.module.dns["live"].aws_route53_record.verification_record["scaffold.ly"] will be created
  + resource "aws_route53_record" "verification_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.bootstrap.module.dns.module.dns["live"].aws_route53_zone.zone will be created
  + resource "aws_route53_zone" "zone" {
      + comment           = "Managed by Terraform"
      + delegation_set_id = (known after apply)
      + force_destroy     = false
      + id                = (known after apply)
      + name              = "scaffold.ly"
      + name_servers      = (known after apply)
      + zone_id           = (known after apply)
    }

  # module.bootstrap.module.dns.module.dns["nonlive"].aws_acm_certificate.apex will be created
  + resource "aws_acm_certificate" "apex" {
      + arn                       = (known after apply)
      + domain_name               = "scaffoldly.dev"
      + domain_validation_options = [
          + {
              + domain_name           = "scaffoldly.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.bootstrap.module.dns.module.dns["nonlive"].aws_acm_certificate.subdomain_wildcard will be created
  + resource "aws_acm_certificate" "subdomain_wildcard" {
      + arn                       = (known after apply)
      + domain_name               = "*.scaffoldly.dev"
      + domain_validation_options = [
          + {
              + domain_name           = "*.scaffoldly.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.bootstrap.module.dns.module.dns["nonlive"].aws_route53_record.verification_record["scaffoldly.dev"] will be created
  + resource "aws_route53_record" "verification_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.bootstrap.module.dns.module.dns["nonlive"].aws_route53_zone.zone will be created
  + resource "aws_route53_zone" "zone" {
      + comment           = "Managed by Terraform"
      + delegation_set_id = (known after apply)
      + force_destroy     = false
      + id                = (known after apply)
      + name              = "scaffoldly.dev"
      + name_servers      = (known after apply)
      + zone_id           = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.aws_iam.data.aws_iam_policy_document.assume_cloudformation_role will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_cloudformation_role"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.aws_iam.data.aws_iam_policy_document.cloudformation will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cloudformation"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + "arn:*:iam::*:role/serverless-example-api*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudformation:CreateStack",
              + "cloudformation:Describe*",
              + "cloudformation:Get*",
              + "cloudformation:List*",
              + "cloudformation:PreviewStackUpdate",
              + "cloudformation:UpdateStack",
            ]
          + resources = [
              + "arn:*:cloudformation:*:*:stack/serverless-example-api*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudformation:ValidateTemplate",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + "arn:*:s3:::serverless-example-api*",
              + "arn:*:s3:::serverless-example-api*/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:*Notification*",
              + "s3:CreateBucket",
              + "s3:ListAllMyBuckets",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "apigateway:DELETE",
              + "apigateway:GET",
              + "apigateway:HEAD",
              + "apigateway:OPTIONS",
              + "apigateway:PATCH",
              + "apigateway:POST",
              + "apigateway:PUT",
            ]
          + resources = [
              + "arn:*:apigateway:*::/apikeys*",
              + "arn:*:apigateway:*::/apikeys/*",
              + "arn:*:apigateway:*::/apis*",
              + "arn:*:apigateway:*::/apis/*",
              + "arn:*:apigateway:*::/restapis*",
              + "arn:*:apigateway:*::/restapis/*",
              + "arn:*:apigateway:*::/usageplans*",
              + "arn:*:apigateway:*::/usageplans/*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:DescribeLogGroups",
            ]
          + resources = [
              + "arn:*:logs:*:*:log-group::log-stream:*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DeleteLogGroup",
              + "logs:DeleteLogStream",
              + "logs:DescribeLogStreams",
              + "logs:FilterLogEvents",
            ]
          + resources = [
              + "arn:*:logs:*:*:log-group:/aws/lambda/serverless-example-api*:log-stream:*",
            ]
        }
      + statement {
          + actions   = [
              + "events:DeleteRule",
              + "events:DescribeRule",
              + "events:PutRule",
              + "events:PutTargets",
              + "events:RemoveTargets",
            ]
          + resources = [
              + "arn:*:events:*:*:rule/serverless-example-api*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:Add*",
              + "lambda:Create*",
              + "lambda:Delete*",
              + "lambda:Get*",
              + "lambda:Invoke*",
              + "lambda:List*",
              + "lambda:Publish*",
              + "lambda:Remove*",
              + "lambda:Tag*",
              + "lambda:Untag*",
              + "lambda:Update*",
            ]
          + resources = [
              + "arn:*:lambda:*:*:function:serverless-example-api*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:*",
            ]
          + resources = [
              + "arn:*:lambda:*:*:function:serverless-example-api*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:*EventSourceMapping*",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:*Tag*",
              + "dynamodb:CreateTable*",
              + "dynamodb:DeleteTable*",
              + "dynamodb:Describe*",
              + "dynamodb:GetShardIterator",
              + "dynamodb:List*",
              + "dynamodb:RestoreTable*",
              + "dynamodb:UpdateContinuousBackups",
              + "dynamodb:UpdateTable*",
            ]
          + resources = [
              + "arn:*:dynamodb:*:*:table/live-serverless-example-api*",
              + "arn:*:dynamodb:*:*:table/nonlive-serverless-example-api*",
            ]
        }
      + statement {
          + actions   = [
              + "xray:*EncryptionConfig*",
              + "xray:*Group*",
              + "xray:*SamplingRule*",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.aws_iam.data.aws_iam_policy_document.deployer will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deployer"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + "arn:*:s3:::serverless-example-api*",
              + "arn:*:s3:::serverless-example-api*/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:*Notification*",
              + "s3:CreateBucket",
              + "s3:ListAllMyBuckets",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudformation:CreateStack",
              + "cloudformation:DeleteStack",
              + "cloudformation:UpdateStack",
            ]
          + resources = [
              + "arn:*:cloudformation:*:*:stack/serverless-example-api*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudformation:Describe*",
              + "cloudformation:Get*",
              + "cloudformation:List*",
              + "cloudformation:PreviewStackUpdate",
              + "cloudformation:ValidateTemplate",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "apigateway:GET",
            ]
          + resources = [
              + "arn:*:apigateway:*::/apikeys*",
              + "arn:*:apigateway:*::/apikeys/*",
            ]
        }
      + statement {
          + actions   = [
              + "apigateway:DELETE",
              + "apigateway:GET",
              + "apigateway:PATCH",
              + "apigateway:POST",
            ]
          + resources = [
              + "arn:*:apigateway:*::/domainnames*",
              + "arn:*:apigateway:*::/domainnames/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:*",
            ]
          + resources = [
              + "arn:*:lambda:*:*:function:serverless-example-api*",
            ]
        }
      + statement {
          + actions   = [
              + "xray:*EncryptionConfig*",
              + "xray:*Group*",
              + "xray:*SamplingRule*",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.aws_iam.aws_iam_access_key.access_key will be created
  + resource "aws_iam_access_key" "access_key" {
      + encrypted_secret     = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + secret               = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      + status               = (known after apply)
      + user                 = "serverless-example-api-deployer"
    }

  # module.bootstrap.module.serverless_api["example"].module.aws_iam.aws_iam_role.cloudformation will be created
  + resource "aws_iam_role" "cloudformation" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "cloudformation.amazonaws.com",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "serverless-example-api-cloudformation"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.aws_iam.aws_iam_role_policy.cloudformation_policy will be created
  + resource "aws_iam_role_policy" "cloudformation_policy" {
      + id     = (known after apply)
      + name   = "base-policy"
      + policy = (known after apply)
      + role   = "serverless-example-api-cloudformation"
    }

  # module.bootstrap.module.serverless_api["example"].module.aws_iam.aws_iam_user.user will be created
  + resource "aws_iam_user" "user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "serverless-example-api-deployer"
      + path          = "/"
      + unique_id     = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.aws_iam.aws_iam_user_policy.assume_cloudformation_role will be created
  + resource "aws_iam_user_policy" "assume_cloudformation_role" {
      + id     = (known after apply)
      + name   = "assume-cloudformation-role"
      + policy = (known after apply)
      + user   = "serverless-example-api-deployer"
    }

  # module.bootstrap.module.serverless_api["example"].module.aws_iam.aws_iam_user_policy.policy will be created
  + resource "aws_iam_user_policy" "policy" {
      + id     = (known after apply)
      + name   = "base-policy"
      + policy = (known after apply)
      + user   = "serverless-example-api-deployer"
    }

  # module.bootstrap.module.serverless_api["example"].module.repository.github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = "master"
      + delete_branch_on_merge = true
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "serverless-example-api"
      + node_id                = (known after apply)
      + private                = true
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)

      + template {
          + owner      = "scaffoldly"
          + repository = "serverless-template-api"
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      + dns_suffix = (known after apply)
      + id         = (known after apply)
      + partition  = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].aws_secretsmanager_secret.secret will be created
  + resource "aws_secretsmanager_secret" "secret" {
      + arn                     = (known after apply)
      + id                      = (known after apply)
      + name                    = "lambda/live/serverless-example-api"
      + name_prefix             = (known after apply)
      + recovery_window_in_days = 30
      + rotation_enabled        = (known after apply)
      + rotation_lambda_arn     = (known after apply)

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].aws_secretsmanager_secret_version.value will be created
  + resource "aws_secretsmanager_secret_version" "value" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_access_key will be created
  + resource "github_actions_secret" "deployer_aws_access_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "LIVE_AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_account_id will be created
  + resource "github_actions_secret" "deployer_aws_account_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "LIVE_AWS_ACCOUNT_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_partition will be created
  + resource "github_actions_secret" "deployer_aws_partition" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "LIVE_AWS_PARTITION"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_rest_api_id will be created
  + resource "github_actions_secret" "deployer_aws_rest_api_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "LIVE_AWS_REST_API_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_rest_api_root_resource_id will be created
  + resource "github_actions_secret" "deployer_aws_rest_api_root_resource_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "LIVE_AWS_REST_API_ROOT_RESOURCE_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_secret_key will be created
  + resource "github_actions_secret" "deployer_aws_secret_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "LIVE_AWS_SECRET_ACCESS_KEY"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      + dns_suffix = (known after apply)
      + id         = (known after apply)
      + partition  = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].aws_secretsmanager_secret.secret will be created
  + resource "aws_secretsmanager_secret" "secret" {
      + arn                     = (known after apply)
      + id                      = (known after apply)
      + name                    = "lambda/nonlive/serverless-example-api"
      + name_prefix             = (known after apply)
      + recovery_window_in_days = 30
      + rotation_enabled        = (known after apply)
      + rotation_lambda_arn     = (known after apply)

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].aws_secretsmanager_secret_version.value will be created
  + resource "aws_secretsmanager_secret_version" "value" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_access_key will be created
  + resource "github_actions_secret" "deployer_aws_access_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "NONLIVE_AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_account_id will be created
  + resource "github_actions_secret" "deployer_aws_account_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "NONLIVE_AWS_ACCOUNT_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_partition will be created
  + resource "github_actions_secret" "deployer_aws_partition" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "NONLIVE_AWS_PARTITION"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_rest_api_id will be created
  + resource "github_actions_secret" "deployer_aws_rest_api_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "NONLIVE_AWS_REST_API_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_rest_api_root_resource_id will be created
  + resource "github_actions_secret" "deployer_aws_rest_api_root_resource_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "NONLIVE_AWS_REST_API_ROOT_RESOURCE_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_secret_key will be created
  + resource "github_actions_secret" "deployer_aws_secret_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "NONLIVE_AWS_SECRET_ACCESS_KEY"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_base_path_mapping.mapping will be created
  + resource "aws_api_gateway_base_path_mapping" "mapping" {
      + api_id      = (known after apply)
      + base_path   = "example"
      + domain_name = (known after apply)
      + id          = (known after apply)
      + stage_name  = "live"
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_deployment.deployment will be created
  + resource "aws_api_gateway_deployment" "deployment" {
      + created_date      = (known after apply)
      + execution_arn     = (known after apply)
      + id                = (known after apply)
      + invoke_url        = (known after apply)
      + rest_api_id       = (known after apply)
      + stage_description = "A basic stage created to remediate a race condition in API Gateway"
      + stage_name        = "bootstrap"
      + triggers          = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_gateway_response.response_cors will be created
  + resource "aws_api_gateway_gateway_response" "response_cors" {
      + id                  = (known after apply)
      + response_parameters = {
          + "gatewayresponse.header.Access-Control-Allow-Headers" = "'*'"
          + "gatewayresponse.header.Access-Control-Allow-Methods" = "'*'"
          + "gatewayresponse.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = "{\"message\":$context.error.messageString}"
        }
      + response_type       = "DEFAULT_4XX"
      + rest_api_id         = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_integration.health_get will be created
  + resource "aws_api_gateway_integration" "health_get" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "GET"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_integration_response.health_get_response_200 will be created
  + resource "aws_api_gateway_integration_response" "health_get_response_200" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = ""
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_method.health_get will be created
  + resource "aws_api_gateway_method" "health_get" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_method_response.health_get_response_200 will be created
  + resource "aws_api_gateway_method_response" "health_get_response_200" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_method_settings.settings will be created
  + resource "aws_api_gateway_method_settings" "settings" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = (known after apply)
      + stage_name  = "live"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = true
          + logging_level                              = "INFO"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = -1
          + throttling_rate_limit                      = -1
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_resource.health will be created
  + resource "aws_api_gateway_resource" "health" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "health"
      + rest_api_id = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_rest_api.api will be created
  + resource "aws_api_gateway_rest_api" "api" {
      + api_key_source           = "HEADER"
      + arn                      = (known after apply)
      + created_date             = (known after apply)
      + execution_arn            = (known after apply)
      + id                       = (known after apply)
      + minimum_compression_size = -1
      + name                     = "example-live"
      + root_resource_id         = (known after apply)

      + endpoint_configuration {
          + types            = (known after apply)
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_stage.stage will be created
  + resource "aws_api_gateway_stage" "stage" {
      + arn                  = (known after apply)
      + deployment_id        = (known after apply)
      + execution_arn        = (known after apply)
      + id                   = (known after apply)
      + invoke_url           = (known after apply)
      + rest_api_id          = (known after apply)
      + stage_name           = "live"
      + xray_tracing_enabled = true

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = "$context.identity.sourceIp $context.identity.caller $context.identity.user [$context.requestTime] \"$context.httpMethod $context.resourcePath $context.protocol\" $context.status $context.responseLength $context.requestId"
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.access_logs_group will be created
  + resource "aws_cloudwatch_log_group" "access_logs_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/apigateway/example-live-access-logs"
      + retention_in_days = 0
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.execution_group will be created
  + resource "aws_cloudwatch_log_group" "execution_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + retention_in_days = 0
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.group will be created
  + resource "aws_cloudwatch_log_group" "group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/apigateway/example-live"
      + retention_in_days = 0
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_base_path_mapping.mapping will be created
  + resource "aws_api_gateway_base_path_mapping" "mapping" {
      + api_id      = (known after apply)
      + base_path   = "example"
      + domain_name = (known after apply)
      + id          = (known after apply)
      + stage_name  = "nonlive"
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_deployment.deployment will be created
  + resource "aws_api_gateway_deployment" "deployment" {
      + created_date      = (known after apply)
      + execution_arn     = (known after apply)
      + id                = (known after apply)
      + invoke_url        = (known after apply)
      + rest_api_id       = (known after apply)
      + stage_description = "A basic stage created to remediate a race condition in API Gateway"
      + stage_name        = "bootstrap"
      + triggers          = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_gateway_response.response_cors will be created
  + resource "aws_api_gateway_gateway_response" "response_cors" {
      + id                  = (known after apply)
      + response_parameters = {
          + "gatewayresponse.header.Access-Control-Allow-Headers" = "'*'"
          + "gatewayresponse.header.Access-Control-Allow-Methods" = "'*'"
          + "gatewayresponse.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = "{\"message\":$context.error.messageString}"
        }
      + response_type       = "DEFAULT_4XX"
      + rest_api_id         = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_integration.health_get will be created
  + resource "aws_api_gateway_integration" "health_get" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "GET"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_integration_response.health_get_response_200 will be created
  + resource "aws_api_gateway_integration_response" "health_get_response_200" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = ""
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method.health_get will be created
  + resource "aws_api_gateway_method" "health_get" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method_response.health_get_response_200 will be created
  + resource "aws_api_gateway_method_response" "health_get_response_200" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method_settings.settings will be created
  + resource "aws_api_gateway_method_settings" "settings" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = (known after apply)
      + stage_name  = "nonlive"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = true
          + logging_level                              = "INFO"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = -1
          + throttling_rate_limit                      = -1
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_resource.health will be created
  + resource "aws_api_gateway_resource" "health" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "health"
      + rest_api_id = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_rest_api.api will be created
  + resource "aws_api_gateway_rest_api" "api" {
      + api_key_source           = "HEADER"
      + arn                      = (known after apply)
      + created_date             = (known after apply)
      + execution_arn            = (known after apply)
      + id                       = (known after apply)
      + minimum_compression_size = -1
      + name                     = "example-nonlive"
      + root_resource_id         = (known after apply)

      + endpoint_configuration {
          + types            = (known after apply)
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_stage.stage will be created
  + resource "aws_api_gateway_stage" "stage" {
      + arn                  = (known after apply)
      + deployment_id        = (known after apply)
      + execution_arn        = (known after apply)
      + id                   = (known after apply)
      + invoke_url           = (known after apply)
      + rest_api_id          = (known after apply)
      + stage_name           = "nonlive"
      + xray_tracing_enabled = true

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = "$context.identity.sourceIp $context.identity.caller $context.identity.user [$context.requestTime] \"$context.httpMethod $context.resourcePath $context.protocol\" $context.status $context.responseLength $context.requestId"
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.access_logs_group will be created
  + resource "aws_cloudwatch_log_group" "access_logs_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/apigateway/example-nonlive-access-logs"
      + retention_in_days = 0
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.execution_group will be created
  + resource "aws_cloudwatch_log_group" "execution_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + retention_in_days = 0
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.group will be created
  + resource "aws_cloudwatch_log_group" "group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/apigateway/example-nonlive"
      + retention_in_days = 0
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].module.iam.data.aws_iam_policy_document.base will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "base"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:*Item*",
              + "dynamodb:Describe*",
              + "dynamodb:List*",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + "arn:*:dynamodb:*:*:table/live-serverless-example-api*",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "arn:*:secretsmanager:*:*:secret:lambda/live/serverless-example-api*",
            ]
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].module.iam.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "serverless-example-api-live"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].module.iam.aws_iam_role_policy.base will be created
  + resource "aws_iam_role_policy" "base" {
      + id     = (known after apply)
      + name   = "base"
      + policy = (known after apply)
      + role   = "serverless-example-api-live"
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].module.iam.data.aws_iam_policy_document.base will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "base"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:*Item*",
              + "dynamodb:Describe*",
              + "dynamodb:List*",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + "arn:*:dynamodb:*:*:table/nonlive-serverless-example-api*",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "arn:*:secretsmanager:*:*:secret:lambda/nonlive/serverless-example-api*",
            ]
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].module.iam.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "serverless-example-api-nonlive"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].module.iam.aws_iam_role_policy.base will be created
  + resource "aws_iam_role_policy" "base" {
      + id     = (known after apply)
      + name   = "base"
      + policy = (known after apply)
      + role   = "serverless-example-api-nonlive"
    }

Plan: 79 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: planfile

To perform exactly these actions, run the following command to apply:
    terraform apply "planfile"

\n\n0
```